# ProjectPhase Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..ProjectPhase Property
EnergyDataSettings Class See Also
---
The project phase of the EnergyData information.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId ProjectPhase { get; set; }
```

Visual Basic
---
```text
Public Property ProjectPhase As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ ProjectPhase {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The input element is not a project phase. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace